---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceNdfType
source: html/40063adc-f130-f608-0fc1-ca765d1d1bdd.htm
---
# Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceNdfType Property

The property labeled "NDF" from the "AdvancedMetal" schema.

## Syntax (C#)
```csharp
public static string SurfaceNdfType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".